elua/moonlight/firmware/eLua/src/platform/stm32/platform.c
// Platform-dependent functions

#include "platform.h"
#include "type.h"
#include "devman.h"
#include "genstd.h"
#include <reent.h>
#include <errno.h>
#include <string.h>
#include <ctype.h>
#include <stdio.h>
#include "uip_arp.h"
#include "elua_uip.h"
#include "elua_adc.h"
#include "uip-conf.h"
#include "platform_conf.h"
#include "diskio.h"
#include "common.h"
#include "buf.h"
#include "utils.h"
#include "sircs.h"
#include "lua.h"
#include "lapi.h"
#include "lrotable.h"
#include "wizc.h"
#include "wiznet.h"

// Platform specific includes
#include "stm32f10x.h"
#include "stm32f10x_exti.h"

// Clock data
// IMPORTANT: if you change these, make sure to modify RCC_Configuration() too!
#define HCLK        ( HSE_Value * 9 )
#define PCLK1_DIV   2
#define PCLK2_DIV   1

// SysTick Config Data
// NOTE: when using virtual timers, SYSTICKHZ and VTMR_FREQ_HZ should have the
// same value, as they're served by the same timer (the systick)
// Max SysTick preload value is 16777215, for STM32F103RET6 @ 72 MHz, lowest acceptable rate would be about 5 Hz
#define SYSTICKHZ               10  
#define SYSTICKMS               (1000 / SYSTICKHZ)

extern void drv_disp_init();

// ****************************************************************************
// Platform initialization

// forward dcls
static void RCC_Configuration(void);
static void NVIC_Configuration(void);

static void timers_init();
static void pwms_init();
static void uarts_init();
static void spis_init();
static void pios_init();
static void adcs_init();
static void cans_init();

// Pass-through data
#define PLATFORM_PASSTHROUGH_PORT       2
#define PLATFORM_PASSTHROUGH_PIN        13
#define PLATFORM_PASSTHROUGH_UART1_ID   0
#define PLATFORM_PASSTHROUGH_UART2_ID   1
static int platform_passthrough_mode;

int platform_init()
{ 
  u8 data;
  // Set the clocking to run from PLL
  RCC_Configuration();

  // Setup IRQ's
  NVIC_Configuration();

  // Setup PIO
  pios_init();
  
  // Setup timers
  timers_init();  
  
  // Check pass-through mode
  platform_pio_op( PLATFORM_PASSTHROUGH_PORT, 1 << PLATFORM_PASSTHROUGH_PIN, PLATFORM_IO_PIN_DIR_INPUT );
  if( platform_pio_op( PLATFORM_PASSTHROUGH_PORT, 1 << PLATFORM_PASSTHROUGH_PIN, PLATFORM_IO_PIN_GET ) == 1 )
  {
    platform_pio_op( PLATFORM_PASSTHROUGH_PORT, 1 << 11, PLATFORM_IO_PIN_DIR_OUTPUT );
    platform_pio_op( PLATFORM_PASSTHROUGH_PORT, 1 << 11, PLATFORM_IO_PIN_SET );      
    // Enter pass-through mode, can only be disabled with a reset 
    platform_passthrough_mode = 1;
    // Setup both serial ports
    platform_uart_setup( PLATFORM_PASSTHROUGH_UART1_ID, 115200, 8, PLATFORM_UART_PARITY_NONE, PLATFORM_UART_STOPBITS_1 );
    platform_uart_set_buffer( PLATFORM_PASSTHROUGH_UART1_ID, 10 );
    platform_uart_setup( PLATFORM_PASSTHROUGH_UART2_ID, 115200, 8, PLATFORM_UART_PARITY_NONE, PLATFORM_UART_STOPBITS_1 );
    platform_uart_set_buffer( PLATFORM_PASSTHROUGH_UART2_ID, 10 );        
    while( 1 )
    {
      if( buf_read( BUF_ID_UART, PLATFORM_PASSTHROUGH_UART1_ID, &data ) == PLATFORM_OK )
        platform_uart_send( PLATFORM_PASSTHROUGH_UART2_ID, data );
      if( buf_read( BUF_ID_UART, PLATFORM_PASSTHROUGH_UART2_ID, &data ) == PLATFORM_OK )
        platform_uart_send( PLATFORM_PASSTHROUGH_UART1_ID, data );      
    }
  }                                                                 
  else
    platform_passthrough_mode = 0;
  
  // Setup UARTs
  uarts_init();
  
  // Setup SPIs
  spis_init();
  
  // Setup PWMs
  pwms_init();

#ifdef BUILD_ADC
  // Setup ADCs
  adcs_init();
#endif
  
  // Setup CANs
  cans_init();
  
  // Enable SysTick
  if ( SysTick_Config( HCLK / SYSTICKHZ ) )
  { 
    /* Capture error */ 
    while (1);
  }

#ifdef ELUA_BOARD_WIZ
  drv_disp_init();
  sircs_init();    
  // Pullup the UART CTS line (PA11)
  platform_pio_op( 0, 1 << 11, PLATFORM_IO_PIN_PULLUP );
  // Set CAN REMAP to 01 to disable CAN TX (silicon bug workaround)
  AFIO->MAPR = ( AFIO->MAPR & ~0x00006000 ) | ( ( 0x01 ) << 13 );
#endif
  
  cmn_platform_init();

  // All done
  return PLATFORM_OK;
}

// ****************************************************************************
// Clocks
// Shared by all STM32 devices.
// TODO: Fix to handle different crystal frequencies and CPU frequencies.

/*******************************************************************************
* Function Name  : RCC_Configuration
* Description    : Configures the different system clocks.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
static void RCC_Configuration(void)
{
  SystemInit();
  
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
  
  // Enable UART clocks here (to accomodate the passthrough mode more easily)
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART4, ENABLE);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART5, ENABLE);  
}

// ****************************************************************************
// NVIC
// Shared by all STM32 devices.

/*******************************************************************************
* Function Name  : NVIC_Configuration
* Description    : Configures the nested vectored interrupt controller.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
/* This struct is used for later reconfiguration of ADC interrupt */
NVIC_InitTypeDef nvic_init_structure_adc;

static void NVIC_Configuration(void)
{
  NVIC_InitTypeDef nvic_init_structure;
  const u32 usart_irqs[] = { USART1_IRQn, USART2_IRQn, USART3_IRQn, UART4_IRQn, UART5_IRQn };
  unsigned i;

#ifdef  VECT_TAB_RAM
  /* Set the Vector Table base location at 0x20000000 */
  NVIC_SetVectorTable(NVIC_VectTab_RAM, 0x0);
#else  /* VECT_TAB_FLASH  */
  /* Set the Vector Table base location at 0x08000000 */
  NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x0);
#endif

  /* Configure the NVIC Preemption Priority Bits */
  NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);

#ifdef BUILD_ADC  
  nvic_init_structure_adc.NVIC_IRQChannel = DMA1_Channel1_IRQn; 
  nvic_init_structure_adc.NVIC_IRQChannelPreemptionPriority = 1; 
  nvic_init_structure_adc.NVIC_IRQChannelSubPriority = 3; 
  nvic_init_structure_adc.NVIC_IRQChannelCmd = DISABLE; 
  NVIC_Init(&nvic_init_structure_adc);
#endif

  // Enable UART interrupts in NVIC
  for( i = 0; i < sizeof( usart_irqs ) / sizeof( u32 ); i ++ )
  {
    nvic_init_structure.NVIC_IRQChannel = usart_irqs[ i ];
    nvic_init_structure.NVIC_IRQChannelSubPriority = 0;
    nvic_init_structure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init( &nvic_init_structure );
  } 
}

// ****************************************************************************
// PIO
// This is pretty much common code to all STM32 devices.
// todo: Needs updates to support different processor lines.
static GPIO_TypeDef * const pio_port[] = { GPIOA, GPIOB, GPIOC, GPIOD, GPIOE, GPIOF, GPIOG };
static const u32 pio_port_clk[]        = { RCC_APB2Periph_GPIOA, RCC_APB2Periph_GPIOB, RCC_APB2Periph_GPIOC, RCC_APB2Periph_GPIOD, RCC_APB2Periph_GPIOE, RCC_APB2Periph_GPIOF, RCC_APB2Periph_GPIOG };

static void pios_init()
{
  GPIO_InitTypeDef GPIO_InitStructure;
  int port;

