elua/moonlight/firmware/eLua/src/platform/stm32/platform.c
void USART2_IRQHandler()
{
#if defined( WIZ_UART_ID ) && WIZ_UART_ID == 1
  wiz_usart_irqhandler( 1 );
#else
  all_usart_irqhandler( 1 );
#endif
}

void USART3_IRQHandler()
{
#if defined( WIZ_UART_ID ) && WIZ_UART_ID == 2
  wiz_usart_irqhandler( 2 );
#else
  all_usart_irqhandler( 2 );
#endif
}

void UART4_IRQHandler()
{
#if defined( WIZ_UART_ID ) && WIZ_UART_ID == 3
  wiz_usart_irqhandler( 3 );
#else
  all_usart_irqhandler( 3 );
#endif
}

void UART5_IRQHandler()
{
#if defined( WIZ_UART_ID ) && WIZ_UART_ID == 4
  wiz_usart_irqhandler( 4 );
#else
  all_usart_irqhandler( 4 );
#endif
}

#endif // #ifdef BUF_ENABLE_UART

int platform_s_uart_set_buffer( unsigned id, unsigned size )
{
  USART_ITConfig( usart[ id ], USART_IT_RXNE, size == 0 ? DISABLE : ENABLE );
  return PLATFORM_OK;
}

static void usart_init(u32 id, USART_InitTypeDef * initVals)
{
  /* Configure USART IO */
  GPIO_InitTypeDef GPIO_InitStructure;

  /* Configure USART Tx Pin as alternate function push-pull */
#ifdef WIZ_UART_ID
  if( WIZ_UART_ID == id && platform_passthrough_mode == 0 )  
    GPIO_InitStructure.GPIO_Pin = usart_gpio_tx_pin[id] | ( 1 << 12 );
  else
#endif
  GPIO_InitStructure.GPIO_Pin = usart_gpio_tx_pin[id];    
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_Init(usart_gpio_tx_port[id], &GPIO_InitStructure);

  /* Configure USART Rx Pin as input floating */
  GPIO_InitStructure.GPIO_Pin = usart_gpio_rx_pin[id];
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(usart_gpio_rx_port[id], &GPIO_InitStructure);

  /* Configure USART */
  USART_Init(usart[id], initVals);

  /* Enable USART */
  USART_Cmd(usart[id], ENABLE);
}

static void uarts_init()
{
  USART_InitTypeDef USART_InitStructure;

#ifndef BUILD_SERMUX
  // Configure the U(S)ART
  USART_InitStructure.USART_BaudRate = CON_UART_SPEED;
  USART_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART_InitStructure.USART_StopBits = USART_StopBits_1;
  USART_InitStructure.USART_Parity = USART_Parity_No;
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
  usart_init( CON_UART_ID, &USART_InitStructure );
  
#if defined( BUF_ENABLE_UART ) && defined( CON_BUF_SIZE )
  platform_uart_set_buffer( CON_UART_ID, CON_BUF_SIZE );
#endif // #if defined( BUF_ENABLE_UART ) && defined( CON_BUF_SIZE )  

#else // #ifndef BUILD_SERMUX
  // Configure the U(S)ART
  USART_InitStructure.USART_BaudRate = SERMUX_PHYS_SPEED;
  USART_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART_InitStructure.USART_StopBits = USART_StopBits_1;
  USART_InitStructure.USART_Parity = USART_Parity_No;
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
  usart_init( SERMUX_PHYS_ID, &USART_InitStructure );
  USART_ITConfig( usart[ SERMUX_PHYS_ID ], USART_IT_RXNE, ENABLE );   
#endif // #ifndef BUILD_SERMUX
}

u32 platform_uart_setup( unsigned id, u32 baud, int databits, int parity, int stopbits )
{
  USART_InitTypeDef USART_InitStructure;

  USART_InitStructure.USART_BaudRate = baud;

#if defined( WIZ_UART_ID )
  if( id == WIZ_UART_ID && platform_passthrough_mode == 0 )
    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS_CTS;
  else
#endif  
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
  
  if( id >= SERVICE_ID_FIRST )
    return 0;

  switch( databits )
  {
    case 5:
    case 6:
    case 7:
    case 8:
      USART_InitStructure.USART_WordLength = USART_WordLength_8b;
      break;
    case 9:
      USART_InitStructure.USART_WordLength = USART_WordLength_9b;
      break;
    default:
      USART_InitStructure.USART_WordLength = USART_WordLength_8b;
      break;
  }

  switch (stopbits)
  {
    case PLATFORM_UART_STOPBITS_1:
      USART_InitStructure.USART_StopBits = USART_StopBits_1;
      break;
    case PLATFORM_UART_STOPBITS_2:
      USART_InitStructure.USART_StopBits = USART_StopBits_2;
      break;
    default:
      USART_InitStructure.USART_StopBits = USART_StopBits_2;
      break;
  }

  switch (parity)
  {
    case PLATFORM_UART_PARITY_EVEN:
      USART_InitStructure.USART_Parity = USART_Parity_Even;
      break;
    case PLATFORM_UART_PARITY_ODD:
      USART_InitStructure.USART_Parity = USART_Parity_Odd;
      break;
    default:
      USART_InitStructure.USART_Parity = USART_Parity_No;
      break;
  }

  usart_init(id, &USART_InitStructure);

  return TRUE;
}

void platform_s_uart_send( unsigned id, u8 data )
{
  while(USART_GetFlagStatus(usart[id], USART_FLAG_TXE) == RESET)
  {
  }
  USART_SendData(usart[id], data);
}

int platform_s_uart_recv( unsigned id, s32 timeout )
{
  if( timeout == 0 )
  {
    if (USART_GetFlagStatus(usart[id], USART_FLAG_RXNE) == RESET)
      return -1;
    else
      return USART_ReceiveData(usart[id]);
  }
  // Receive char blocking
  while(USART_GetFlagStatus(usart[id], USART_FLAG_RXNE) == RESET);
  return USART_ReceiveData(usart[id]);
}

int platform_s_uart_data_ready( unsigned id )
{
  return USART_GetFlagStatus( usart[ id ], USART_FLAG_RXNE ) == SET;
}

// ****************************************************************************
// Timers

// We leave out TIM6/TIM7 for now, as they are dedicated
// TIM8 is used for PWM generation, so it's not included here (see PWM section)
static TIM_TypeDef * const timer[] = { TIM1, TIM2, TIM3, TIM4, TIM5 };
#define TIM_GET_PRESCALE( id ) ( ( id ) == 0 || ( id ) == 5 ? ( PCLK2_DIV ) : ( PCLK1_DIV ) )
#define TIM_GET_BASE_CLK( id ) ( TIM_GET_PRESCALE( id ) == 1 ? ( HCLK / TIM_GET_PRESCALE( id ) ) : ( HCLK / ( TIM_GET_PRESCALE( id ) / 2 ) ) )
#define TIM_STARTUP_CLOCK       50000

static u32 timer_set_clock( unsigned id, u32 clock );

void SysTick_Handler( void )
{
  // Handle virtual timers
  cmn_virtual_timer_cb();

